<template>
    <div class="container">
        <Head />   
        <Promo />
        <Articles :data="articles" />
        <Footer />
        
    </div>
</template>

<script>
import Head from './components/Head.vue'
import Promo from './components/Promo.vue'
import Articles from './components/Articles.vue'
import Footer from './components/Footer.vue'
export default {
    components: { Head, Promo, Articles, Footer},
    data(){
        return {
            articles: [
            {'id': 1, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 2, 'foto': 'https://itproger.com/img/news/1516366532.jpg', 'title': '10 самых популярных сайтов написанных на Django', 'intro': 'Django набирает популярность и многие крупные компании используют его для создания веб проектов. Мы подобрали 10 популярных сайтов, написанных на Django.'},
            {'id': 3, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 4, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 5, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 6, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 7, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 8, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 9, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 10, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 11, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            {'id': 12, 'foto': 'https://itproger.com/img/news/1517501131.jpg', 'title': 'Устаревшие языки, которые уже не стоит изучать', 'intro': 'Есть много ЯП, которые уже отжили свое, но их все равно продолжают изучать. В этой статье мы расскажем про 5 языков, которые уже точно не стоит изучать, хотя многие до сих пор делают это.'},
            ]
        }
    }
}
</script>

<style lang="scss">
$mainColor: #000000;
$textColor: #fff;
$additionColor: #25ab75;




::selection {
    background: $additionColor;
}

*{
    margin: 0;
    padding: 0;
}
body {
    background: rgb(223, 223, 223);
    color: $textColor;
    font-weight: 400;
    font-size: 1em;
}

a {
    color: #ABABAB;
    text-decoration: none;
    &:hover {
        color: #c7c7c7
    }
}



</style>